app/controllers/admin_users_controller.rb

  def create
    @admin_user = AdminUser.new(admin_user_params)
    if @admin_user.save
---
INSERT INTO `admin_users` (`first_name`, `last_name`, `email`, `username`, `password_digest`, `created_at`, `updated_at`) VALUES ('Angelina', 'Obrien', 'angel@gmail.com', 'aobrien1234', '$2a$10$he9e6EFkqAU9U8noEOC4W.XV0t0qnn8RaHZX1Y0PcGOxzFGiAh7f6', '2016-03-10 18:11:49', '2016-03-10 18:11:49')

  def delete
    @admin_user = AdminUser.find(params[:id])
---
SELECT  `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 1 LIMIT 1

  def destroy
    AdminUser.find(params[:id]).destroy
---
DELETE FROM `admin_users` WHERE `admin_users`.`id` = 1
SELECT  `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 1 LIMIT 1