app/controllers/pages_controller.rb

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1
---
  def show
    @page =Page.find(params[:id])

SELECT COUNT(*) FROM `pages`
SELECT `subjects`.* FROM `subjects`  ORDER BY position ASC
---
  def new
    @page = Page.new({:subject_id => @subject.id})
    @page_count = Page.count + 1
    @subjects = Subject.order('position ASC')

INSERT INTO `pages` (`name`, `subject_id`, `permalink`, `position`, `visible`, `created_at`, `updated_at`) VALUES ('Third Subject First Page', 4, 1, 1, 1, '2016-03-14 15:57:37', '2016-03-14 15:57:37')
SELECT `subjects`.* FROM `subjects`  ORDER BY position ASC
SELECT COUNT(*) FROM `pages`
---
  def create
    @page = Page.new(page_params)
    if @page.save
      flash[:notice] = "Page created successfully"
      redirect_to(:action => 'index', :subject_id => @subject.id)
    else
      @subjects = Subject.order('position ASC')
      @page_count = Page.count + 1

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1
SELECT `subjects`.* FROM `subjects`  ORDER BY position ASC
SELECT COUNT(*) FROM `pages`
---
  def edit
    @page = Page.find(params[:id])
    @subjects = Subject.order('position ASC')
    @page_count = Page.count

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 3 LIMIT 1
UPDATE `pages` SET `subject_id` = 2, `updated_at` = '2016-03-07 14:22:19' WHERE `pages`.`id` = 3
SELECT `subjects`.* FROM `subjects`  ORDER BY position ASC
SELECT COUNT(*) FROM `pages`
---
  def update
    @page = Page.find(params[:id])
    if @page.update_attributes(page_params)
      flash[:notice] = "Page updated successfully"
      redirect_to(:action => 'show', :id => @page.id, :subject_id => @subject.id)
    else
      @subjects = Subject.order('position ASC')
      @page_count = Page.count

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1
---
  def delete
    @page = Page.find(params[:id])

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
---
    def find_subject
      if params[:subject_id]
        @subject = Subject.find(params[:subject_id])