app/controllers/pages_controller.rb

SELECT `pages`.* FROM `pages`  ORDER BY pages.position ASC
---
  def index
    @pages = Page.order("pages.position ASC")