app/controllers/sections_controller.rb

  def index
    @sections = Section.where(:page_id => @page.id).order("position ASC")
---
SELECT `sections`.* FROM `sections` WHERE `sections`.`page_id` = 2  ORDER BY position ASC

  def show
    @section = Section.find(params[:id])
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1

  def new
    @section = Section.new({:page_id => @page.id})
    @pages = Page.order('position ASC')
    @section_count = Section.count + 1
---
SELECT `pages`.* FROM `pages`  ORDER BY position ASC
SELECT COUNT(*) FROM `sections`

  def create
    @section = Section.new(section_params)
    if @section.save
---
INSERT INTO `sections` (`name`, `page_id`, `position`, `visible`, `content_type`, `content`, `created_at`, `updated_at`) VALUES ('Test section', 2, 1, 1, 'text', 'blah blah blah', '2016-03-14 13:53:27', '2016-03-14 13:53:27')

  def edit
    @section = Section.find(params[:id])
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1

  def delete
    @section = Section.find(params[:id])
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1

    def find_page
      if params[:page_id]
        @page = Page.find(params[:page_id])
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1