app/controllers/sections_controller.rb

  def index
    @sections = Section.order("sections.position ASC")
---
SELECT `sections`.* FROM `sections`  ORDER BY sections.position ASC