app/controllers/subjects_controller.rb

  def show
    @subject = Subject.find(params[:id])
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1

  def new
    @subject = Subject.new
    @subject_count = Subject.count + 1
---
SELECT COUNT(*) FROM `subjects`

  def create
    # Instantiate a new object
    @subject = Subject.new(subject_params)
    # Save the new instance of the object
    if @subject.save
---
INSERT INTO `subjects` (`name`, `position`, `visible`, `created_at`, `updated_at`) VALUES ('Test Subject', 8, 0, '2016-02-29 12:58:27', '2016-02-29 12:58:27')

  def edit
    @subject = Subject.find(params[:id])
    @subject_count = Subject.count
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 5 LIMIT 1
SELECT COUNT(*) FROM `subjects`

  def update
    # Find an existing object using form parameters
    @subject = Subject.find(params[:id])
    # Update the object
    if @subject.update_attributes(subject_params)
      # If update succeeds, redirect to show page
      flash[:notice] = "Subject updated successfully"
      redirect_to(:action => 'show', :id => @subject.id)
    else
      # If update fails, redisplay the form so user can fix errors
      @subject_count = Subject.count
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 5 LIMIT 1
UPDATE `subjects` SET `name` = 'Revised Subject', `visible` = 0, `updated_at` = '2016-02-29 21:35:09' WHERE `subjects`.`id` = 2
SELECT COUNT(*) FROM `subjects` WHERE (1 = 1) AND (position = 3)

  def delete
    @subject = Subject.find(params[:id])
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 5 LIMIT 1

  def destroy
    subject = Subject.find(params[:id]).destroy
---
DELETE FROM `subjects` WHERE `subjects`.`id` = 5
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 5 LIMIT 1